In [2]:
# 경고 메시지 무시
import warnings
warnings.filterwarnings(action='ignore')

In [3]:
# !pip install pandas

In [4]:
import pandas as pd

In [6]:
# 리스트를 Pandas 시리즈로 변환

pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
pd_list = [1,2,3,4,5]
pd_s2 = pd.DataFrame(pd_list)
pd_s2['1열'] = pd_list
pd_s2

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [8]:
pd_s2.columns

Index([0, '1열'], dtype='object')

In [9]:
pd_s3 = pd_s2.rename(columns = {0:'0열'})
pd_s3

   0열  1열
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [10]:
### 2차원 리스트를 데이터프레임으로 변환

score=[['정약용', 70, 80, 100],
 ['이순신', 100, 80, 70],
 ['이율곡', 90, 95, 90]]
print(type(score))
score

<class 'list'>

[['정약용', 70, 80, 100], ['이순신', 100, 80, 70], ['이율곡', 90, 95, 90]]

In [13]:
score_df = pd.DataFrame(score)
print(type(score_df))
score_df

<class 'pandas.core.frame.DataFrame'>

     0    1   2    3
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [15]:
score_df.columns = ['이름', '국어','영어','수학']
score_df

    이름   국어  영어   수학
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [16]:
score_df.columns = ['성명', 'Kor','Eng','Mat']
score_df

    성명  Kor  Eng  Mat
0  정약용   70   80  100
1  이순신  100   80   70
2  이율곡   90   95   90

In [17]:
score_df.values

array([['정약용', 70, 80, 100],
       ['이순신', 100, 80, 70],
       ['이율곡', 90, 95, 90]], dtype=object)

In [18]:
score_df.shape

(3, 4)

In [20]:
score_df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
n=pd.DataFrame({'col_str1':['1', '2', '3', '4'],
                'col_str2':['5', '6', '7', '8']})
print(n)
n.dtypes

  col_str1 col_str2
0        1        5
1        2        6
2        3        7
3        4        8

col_str1    object
col_str2    object
dtype: object

In [22]:
n_df = n.astype({'col_str1': int, 'col_str2': float})
print(n_df)
n_df.dtypes

   col_str1  col_str2
0         1       5.0
1         2       6.0
2         3       7.0
3         4       8.0

col_str1      int32
col_str2    float64
dtype: object

In [23]:
score_df.index = score_df['성명']
score_df

      성명  Kor  Eng  Mat
성명
정약용  정약용   70   80  100
이순신  이순신  100   80   70
이율곡  이율곡   90   95   90

In [25]:
score_df.drop(['성명'], axis = 1, inplace = True)

In [26]:
score_df

     Kor  Eng  Mat
성명
정약용   70   80  100
이순신  100   80   70
이율곡   90   95   90

In [27]:
score_df.drop(['이순신'], axis = 0)

     Kor  Eng  Mat
성명
정약용   70   80  100
이율곡   90   95   90

In [28]:
import pandas as pd
x=[0, 1, 2, 3, 4, 5]
y=[0, 2, 4, 6, 8, 10]
df=pd.DataFrame( )
df['x_value']=x
df['y_value']=y
df

   x_value  y_value
0        0        0
1        1        2
2        2        4
3        3        6
4        4        8
5        5       10

In [30]:
df['xy_value'] = df['x_value'] * df['y_value']
df

   x_value  y_value  xy_value
0        0        0         0
1        1        2         2
2        2        4         8
3        3        6        18
4        4        8        32
5        5       10        50

In [33]:
# df['number'] = ['zero','one','two','three','four','five']
# df

i = ['zero','one','two','three','four','five']
df['number'] = i
df

   x_value  y_value  xy_value number
0        0        0         0   zero
1        1        2         2    one
2        2        4         8    two
3        3        6        18  three
4        4        8        32   four
5        5       10        50   five

In [34]:
df.set_index( 'number', append = True ) #기존 인덱스 유지

          x_value  y_value  xy_value
  number
0 zero          0        0         0
1 one           1        2         2
2 two           2        4         8
3 three         3        6        18
4 four          4        8        32
5 five          5       10        50

In [35]:
df.set_index( 'number', append = False )

        x_value  y_value  xy_value
number
zero          0        0         0
one           1        2         2
two           2        4         8
three         3        6        18
four          4        8        32
five          5       10        50

In [36]:
df3 = df.reset_index(drop = True)
df3

   x_value  y_value  xy_value number
0        0        0         0   zero
1        1        2         2    one
2        2        4         8    two
3        3        6        18  three
4        4        8        32   four
5        5       10        50   five

In [38]:
date = pd.date_range('20230101', periods = 6)
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [39]:
df4 = df3.reset_index(drop = True )
df5 = df4.set_index(date)
df5

            x_value  y_value  xy_value number
2023-01-01        0        0         0   zero
2023-01-02        1        2         2    one
2023-01-03        2        4         8    two
2023-01-04        3        6        18  three
2023-01-05        4        8        32   four
2023-01-06        5       10        50   five

In [50]:
df5.drop(['number'], axis = 1, inplace = True)
df5['mean'] = df5.mean(axis = 1)
df5

            x_value  y_value  xy_value       mean
2023-01-01        0        0         0   0.000000
2023-01-02        1        2         2   1.666667
2023-01-03        2        4         8   4.666667
2023-01-04        3        6        18   9.000000
2023-01-05        4        8        32  14.666667
2023-01-06        5       10        50  21.666667